core/app/controllers/features_controller.rb

SELECT * FROM "features" WHERE ("features"."name" = 'foo') LIMIT 1
---
  def show
    feature = Feature.by_name(params[:id]).first

SELECT * FROM "apps" WHERE ("apps"."id" = 1)
---
  def enable
    app = App.find(params[:app_id])